BAS BMEKZU Project/src/Documents/ИНАГРО_КонвертацияВалюты/ИНАГРО_КонвертацияВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_КонвертацияВалюты</name>
  <basedOn>Document.СписаниеСРасчетногоСчета</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсоваяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсУМВРПокупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсУМВРПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПокупаемаяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродаваемаяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СписываемаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратКурсоваяРазница</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1ЗатратКурсоваяРазница</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2ЗатратКурсоваяРазница</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3ЗатратКурсоваяРазница</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходовКурсоваяРазница</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1ДоходовКурсоваяРазница</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2ДоходовКурсоваяРазница</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3ДоходовКурсоваяРазница</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратКомиссионные</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1ЗатратКомиссионные</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2ЗатратКомиссионные</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3ЗатратКомиссионные</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалютнаяПокупаемая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалютнаяПродаваемая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаГривневаяПокупаемая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКомиссионные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСебестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстановитьКурсВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидНалоговойДеятельности</name>
    <type>
      <types>CatalogRef.ВидыНалоговойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПокупкаПродажаВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗаявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПокупкуПродажуВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКурсПокупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбщаяСуммаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтражатьВНалоговомУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяВаловыхДоходов</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяВаловыхРасходов</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяВаловыхРасходовКомиссионные</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяВаловыхРасходовПенсионный</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто1ДоходовКурсоваяРазница</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто1ЗатратКурсоваяРазница</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто1ЗатратПенсионный</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто2ДоходовКурсоваяРазница</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто2ЗатратКурсоваяРазница</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто2ЗатратПенсионный</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто3ДоходовКурсоваяРазница</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто3ЗатратКурсоваяРазница</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто3ЗатратПенсионный</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСуммаПенсионный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетДоходовКурсоваяРазница</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетЗатратКурсоваяРазница</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетЗатратПенсионный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийКурсУМВР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

BAS BMEKZU Project/src/Enums/ВидыПрочихСчетовУчета/ВидыПрочихСчетовУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПрочихСчетовУчета</name>
  <enumValues>
    <name>СчетДоходовВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>СчетЗатратВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>СчетЗатратОтчетКомиссионераОПродажах</name>
  </enumValues>
  <enumValues>
    <name>СчетЗатратКурсоваяРазницаПокупкаПродажаВалюты</name>
  </enumValues>
  <enumValues>
    <name>СчетДоходовКурсоваяРазницаПокупкаПродажаВалюты</name>
  </enumValues>
  <enumValues>
    <name>СчетЗатратКомиссионныеПокупкаПродажаВалюты</name>
  </enumValues>
  <enumValues>
    <name>СчетЗатратПенсионныйПродажаВалюты</name>
  </enumValues>
  <enumValues>
    <name>СчетЗатратСебестоимостьПродажаВалюты</name>
  </enumValues>
  <enumValues>
    <name>СчетДоходовСебестоимостьПродажаВалюты</name>
  </enumValues>
  <enumValues>
    <name>СчетДтСписаниеЗадолженностиКорректировкаДолга</name>
  </enumValues>
  <enumValues>
    <name>СчетКтСписаниеЗадолженностиКорректировкаДолга</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/КлассыСчетовРасходов/КлассыСчетовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КлассыСчетовРасходов</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Класс8</name>
  </enumValues>
  <enumValues>
    <name>Класс9</name>
  </enumValues>
  <enumValues>
    <name>Класс8и9</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Documents/ИНАГРО_КонвертацияВалюты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура устанавливает счета учета
//
// Параметры:
// Объект - СправочникСсылка - объект контактной информации
//
Процедура УстановитьСчетаУчета(Объект) Экспорт
	
	ИспользуемыеКлассыСчетовРасходов = УчетнаяПолитика.ИспользуемыеКлассыСчетовРасходов(Объект.Организация, Объект.Дата);
		
	СчетУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетУчетаПрочий(Объект.Организация, Перечисления.ВидыПрочихСчетовУчета.СчетЗатратКурсоваяРазницаПокупкаПродажаВалюты);
	Объект.СчетЗатратКурсоваяРазница	  = СчетУчета.СчетУчетаБУ;
	Объект.Субконто1ЗатратКурсоваяРазница = СчетУчета.Субконто1;
	Объект.Субконто2ЗатратКурсоваяРазница = СчетУчета.Субконто2;
	Объект.Субконто3ЗатратКурсоваяРазница = СчетУчета.Субконто3;	
	Если НЕ ЗначениеЗаполнено(Объект.СчетЗатратКурсоваяРазница) Тогда
		Если ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8 Тогда
			Объект.СчетЗатратКурсоваяРазница = ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты;
		Иначе
			Объект.СчетЗатратКурсоваяРазница = ПланыСчетов.Хозрасчетный.ЗатратыОтОперационнойКурсовойРазницы;
		КонецЕсли;
	КонецЕсли;
	
	СчетУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетУчетаПрочий(Объект.Организация, Перечисления.ВидыПрочихСчетовУчета.СчетДоходовКурсоваяРазницаПокупкаПродажаВалюты);
	Объект.СчетДоходовКурсоваяРазница	   = СчетУчета.СчетУчетаБУ;
	Объект.Субконто1ДоходовКурсоваяРазница = СчетУчета.Субконто1;
	Объект.Субконто2ДоходовКурсоваяРазница = СчетУчета.Субконто2;
	Объект.Субконто3ДоходовКурсоваяРазница = СчетУчета.Субконто3;	
	Если НЕ ЗначениеЗаполнено(Объект.СчетДоходовКурсоваяРазница) Тогда
		Объект.СчетДоходовКурсоваяРазница = ПланыСчетов.Хозрасчетный.ДоходОтОперационнойКурсовойРазницы;
	КонецЕсли; 
	
	СчетУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетУчетаПрочий(Объект.Организация, Перечисления.ВидыПрочихСчетовУчета.СчетЗатратКомиссионныеПокупкаПродажаВалюты);
	Объект.СчетЗатратКомиссионные	   = СчетУчета.СчетУчетаБУ;
	Объект.Субконто1ЗатратКомиссионные = СчетУчета.Субконто1;
	Объект.Субконто2ЗатратКомиссионные = СчетУчета.Субконто2;
	Объект.Субконто3ЗатратКомиссионные = СчетУчета.Субконто3;	
	Если НЕ ЗначениеЗаполнено(Объект.СчетЗатратКомиссионные) Тогда
		Если ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8 Тогда
			Объект.СчетЗатратКомиссионные = ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты;
		Иначе
			Объект.СчетЗатратКомиссионные = ПланыСчетов.Хозрасчетный.АдминистративныеРасходы;
		КонецЕсли;
	КонецЕсли;    	
		
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
